In [29]:
#import necessary Libraries
import pandas as pd 
import numpy as np
import sqlite3
#sadsd=pd.read_csv('Data/bom.movie_gross.csv')
#load data set
conn = sqlite3.connect('Data/im.db')
df3=pd.read_sql('Select * from movie_basics', conn)
df3
#genre_counts=pd.read_sql('Select Count (*) ,genres from movie_basics  Group By genres  Order By Count(genres) Limit 30; ', conn)

#genres=['Documentary', 'Drama,Comedy','Horror','Thriller','Action','Bigoraphy','Romance' ,'Music','History','Family','Sport','Animation','Crime','Scifi','War']
#genre
#Documentary, Drama,Comedy,Horror,Thriller,Action,Bigoraphy,Romance ,Music,History,Family,Sport,Animation,Crime,Scifi

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [2]:
df1=pd.read_sql('Select movie_id,title,region from movie_akas', conn)
df1

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [28]:
df2=pd.read_sql('Select * from movie_ratings Where numvotes>25', conn)
df2

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1043726            4.2     50352
3       tt1069246            6.2       326
4       tt1094666            7.0      1613
...           ...            ...       ...
45752   tt9633108            3.9        44
45753   tt9668598            5.5       317
45754   tt9690762            5.6        37
45755   tt9768966            8.6        27
45756   tt9894098            6.3       128

[45757 rows x 3 columns]

In [32]:
df=pd.read_sql('Select movie_basics.movie_id,movie_basics.primary_title,movie_basics.original_title,movie_basics.start_year,movie_basics.runtime_minutes,movie_basics.genres,movie_ratings.averagerating,movie_ratings.numvotes,movie_akas.title,movie_akas.region from movie_basics join movie_akas Using (movie_id) join movie_ratings Using(movie_id)  Where numvotes>25 Order By numvotes', conn)
df

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,title,region
0,tt1608246,Therapissed,Therapissed,2010,76.0,Comedy,8.0,26,Therapissed,US
1,tt6547822,Bloody Murder,Bloody Murder,2017,70.0,Thriller,3.7,26,Bloody Murder,US
2,tt7024660,Good Morning Pakistan,Salam Pakistan,2018,120.0,"Comedy,Mystery,Romance",8.1,26,Good Morning Pakistan,US
3,tt7024660,Good Morning Pakistan,Salam Pakistan,2018,120.0,"Comedy,Mystery,Romance",8.1,26,Salam Pakistan,None
4,tt7024660,Good Morning Pakistan,Salam Pakistan,2018,120.0,"Comedy,Mystery,Romance",8.1,26,Salam Pakistan,PK
...,...,...,...,...,...,...,...,...,...,...
219445,tt1375666,Inception,Inception,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066,Începutul,RO
219446,tt1375666,Inception,Inception,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066,Οι ονειροπαγιδευτές,GR
219447,tt1375666,Inception,Inception,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066,Генезис,BG
219448,tt1375666,Inception,Inception,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066,Начало,RU
219449,tt1375666,Inception,Inception,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066,Початок,UA

In [33]:
df['genres'] = df['genres'].fillna(value='None')
df.isna().any()
len(df[df.runtime_minutes.isna()])/ len(df)
df['original_title'] = df['original_title'].fillna(value=df['primary_title'])
df["genres"].value_counts()
df["original_title"].value_counts()
df["primary_title"].value_counts()
df["runtime_minutes"].value_counts()

In [3]:
genre_table=pd.read_sql('Select genres,movie_id from movie_basics', conn)
genre_table['genres'] = genre_table['genres'].fillna(value='None')
g=[]
j=[]
count=0
for i in genre_table['genres']:
    j=i.split(',')
    g.append(j)
genre_table['genres']=g
ids = []
genre = []
vote_averages = []
temp = {'movie_ids': ids, 'genres': genre}

for index, row in genre_table.iterrows():
    for gen in row[0]:
        ids.append(row[1])
        genre.append(gen)
        

genres_frame = pd.DataFrame(temp)
genres_frame

        movie_ids       genres
0       tt0063540       Action
1       tt0063540        Crime
2       tt0063540        Drama
3       tt0066787    Biography
4       tt0066787        Drama
...           ...          ...
234953  tt9916538        Drama
234954  tt9916622  Documentary
234955  tt9916706       Comedy
234956  tt9916730         None
234957  tt9916754  Documentary

[234958 rows x 2 columns]

In [4]:
#check to see what values are null
df.isna().any()
len(df[df.runtime_minutes.isna()])/ len(df)
#20% of movies do not have runtime listed

0.21717620976571053

In [5]:
#transform minutes into hours and minutes
#replace na values with average movie length
z=df['runtime_minutes'].mean()
df['runtime_minutes'] = df['runtime_minutes'].fillna(value=0)
df['hours']= df['runtime_minutes']/60
df['minutes']=df['runtime_minutes'] %60
df['minutes']=df['minutes'].round

In [6]:
#other option is drop it
df.dropna(subset=['runtime_minutes'],inplace=True)

In [7]:
#replace original titles that are na with primary title
df['original_title'] = df['original_title'].fillna(value=df['primary_title'])

In [8]:
#replace na genres with none

In [9]:
#check to see values are okay
df["genres"].value_counts()
df["original_title"].value_counts()
df["primary_title"].value_counts()
df["runtime_minutes"].value_counts()

0.0      31739
90.0      7131
80.0      3526
85.0      2915
100.0     2662
         ...
323.0        1
221.0        1
321.0        1
319.0        1
540.0        1
Name: runtime_minutes, Length: 368, dtype: int64

In [10]:
movie_akas=pd.read_sql('Select * from movie_akas', conn)
movie_akas

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [11]:
movie_akas["attributes"].value_counts()

new title                      1700
alternative spelling           1394
literal English title          1054
complete title                 1034
original subtitled version      879
                               ...
reissue titleshort version       1
first season title                1
TV listings title                 1
8mm release title                 1
X-rated version                   1
Name: attributes, Length: 77, dtype: int64

In [12]:
movie_akas.isna().any()

movie_id             False
ordering             False
title                False
region                True
language              True
types                 True
attributes            True
is_original_title     True
dtype: bool

In [13]:
len(movie_akas[movie_akas.language.isna()])/ len(movie_akas)

0.87423990738703

In [14]:
len(movie_akas[movie_akas.region.isna()])/ len(movie_akas)

0.16066481159350382

In [15]:
movie_akas['language'] = movie_akas['language'].fillna(value=movie_akas['region'])

In [16]:
pd.read_sql('Select Count(*)  from movie_basics', conn)

   Count(*)
0    146144

In [17]:
#Anything below This is stuff that we probably will not use more exploratory purposes

In [18]:
#replace none with average
pd.read_sql('Select AVG(runtime_minutes)  from movie_basics', conn)

   AVG(runtime_minutes)
0             86.187247

In [19]:
pd.read_sql('Select * from movie_ratings', conn)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [20]:
pd.read_sql('Select Count(*)  from movie_ratings', conn)

   Count(*)
0     73856

In [21]:
pd.read_sql('Select Count(*)  from movie_ratings Where numvotes<6', conn)

   Count(*)
0      2699

In [22]:
pd.read_sql('Select Count(*)  from movie_ratings Where numvotes<7', conn)

   Count(*)
0      5574

In [23]:
pd.read_sql('Select AVG(numvotes)  from movie_ratings ', conn)

   AVG(numvotes)
0    3523.662167

In [24]:
pd.read_sql('Select Count(*)  from movie_ratings Where numvotes<1000', conn)

   Count(*)
0     64239

In [25]:
pd.read_sql('Select * from principals', conn)

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [26]:
#conn.close()